lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
									switch(uuid)
									{
										case(CYCLING_SPEED_CADENCE_SERVICE_UUID):
										{
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence = true;
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed = true;
#if(CFG_DEBUG_APP_TRACE != 0)
											APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
											#if (UUID_128BIT_FORMAT==1)
											SERVICES_HANDLE[index].P2PServiceHandle_CSC = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
											SERVICES_HANDLE[index].P2PServiceEndHandle_CSC = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
#else
											SERVICES_HANDLE[index].P2PServiceHandle_CSC = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
											SERVICES_HANDLE[index].P2PServiceEndHandle_CSC = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
#endif
											break;
										}
										case(CYCLING_POWER_SERVICE_UUID):
										{
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power = true;
											break;
										}
										case(BATTERY_SERVICE_UUID):
										{
											scannedDevicesPackage.scannedDevicesList[index].supportedDataType.battery = true;
											break;
										}
									}
									idx += 6;
								}
								if (scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == true)
								{
									TYPE_OF_SENSOR = TRAINER;
								}
								else if(scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == true &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == false)
								{
									TYPE_OF_SENSOR = CSC_SENSOR;
								}
								else if(scannedDevicesPackage.scannedDevicesList[index].supportedDataType.cadence == false &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.speed == false &&
										scannedDevicesPackage.scannedDevicesList[index].supportedDataType.power == true)
								{
									TYPE_OF_SENSOR = POWER_SENSOR;
								}
								else{
									TYPE_OF_SENSOR = OTHER;
								}

								switch(TYPE_OF_SENSOR){
									case POWER_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#else
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case TRAINER:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
										aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
#else
										aP2PClientContext[index].P2PServiceHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
										aP2PClientContext[index].P2PServiceEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
									case CSC_SENSOR:
									{
#if(CFG_DEBUG_APP_TRACE != 0)
										APP_DBG_MSG("-- GATT : SENSOR_SERVICE_UUID FOUND - connection handle 0x%x \n", aP2PClientContext[index].connHandle);
#endif
										#if (UUID_128BIT_FORMAT==1)
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#else
										aP2PClientContext[index].P2PServiceHandle = SERVICES_HANDLE[index].P2PServiceHandle_CSC;
										aP2PClientContext[index].P2PServiceEndHandle = SERVICES_HANDLE[index].P2PServiceEndHandle_CSC;
#endif
										aP2PClientContext[index].state = APP_BLE_DISCOVER_CHARACS ;
										break;
									}
								}

                            }
                        }
                    }
                    break;

                case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_READ_BY_TYPE_RESP */

                    /* USER CODE END EVT_BLUE_ATT_READ_BY_TYPE_RESP */
                    aci_att_read_by_type_resp_event_rp0 *pr = (void*)blue_evt->data;

                    uint8_t idx;
                    uint16_t uuid, handle;

                    /* the event data will be
                     * 2 bytes start handle
                     * 1 byte char properties
                     * 2 bytes handle
                     * 2 or 16 bytes data
                     */

                    uint8_t index;

                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (aP2PClientContext[index].connHandle != pr->Connection_Handle))
                        index++;

                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {

                        /* we are interested in only 16 bit UUIDs */
#if (UUID_128BIT_FORMAT==1)
                        idx = 17;
                        if (pr->Handle_Value_Pair_Length == 21)
#else
                            idx = 5;
                        if (pr->Handle_Value_Pair_Length == 7)
#endif
                        {
                            pr->Data_Length -= 1;
                            while(pr->Data_Length > 0)
                            {
                                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx]);
                                /* store the characteristic handle not the attribute handle */
#if (UUID_128BIT_FORMAT==1)
                                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);
#else
                                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-2]);
#endif
                                if(uuid == CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID)
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	  APP_DBG_MSG("-- GATT : SENSOR_NOTIFY_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif
                                    aP2PClientContext[index].P2PNotificationCharHdle = handle;
                                    aP2PClientContext[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
                                }
                                else if (uuid == CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID)
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	APP_DBG_MSG("-- GATT : SENSOR_READ_CHAR_UUID FOUND  - connection handle 0x%x\n", aP2PClientContext[index].connHandle);
#endif

                                	aP2PClientContext[index].state = APP_BLE_READ_CHARACS;
									aP2PClientContext[index].P2PReadCharHdle = handle;
									aP2PClientContext[index].P2PcurrentCharBeingRead = CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID;

